---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SteelElementsFailures.SteelElementInvisibleInCurrentLevelOfDetailWarn
source: html/89a23ed6-a01c-a35e-1fde-78bb7a16c122.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SteelElementsFailures.SteelElementInvisibleInCurrentLevelOfDetailWarn Property

The created elements are only visible in Detail Level: Fine.

## Syntax (C#)
```csharp
public static FailureDefinitionId SteelElementInvisibleInCurrentLevelOfDetailWarn { get; }
```